public class Task4 {
    public static void main(String[] args) {
        System.out.println("Скобочная последовательность -  [((())()(())]]\n");
        System.out.println("  данная скобочная последовательность не правильная. Для того,\n" +
                "    чтобы она была правильная нужно убрать последнюю или предпоследнюю квадратную скобку\n" +
                "    или добавить куда-нибудь внутрь одну квадратную скобку(открывающую). А также у нас разное количество открывающих и закрывающих\n" +
                "    круглых скобок( открывающих 6, закрывающих 5), а их количество должно быть равно, также как и любых других скобок( количество открывающих= количество закрывающих).\n" +
                "    Можно добавить одну закрывающую скобку после любой открывающей, или удалить одну любую открывающую");


    }
}
